#+TITLE: Parameter tutorial
#+AUTHOR: Alexey Cherkaev
#+LATEX_CLASS: article

* Introduction

Parameters are created with the "keyword-generic" function
~PARAMETER~. For example, single parameter can be constructed as follows:

#+BEGIN_SRC lisp :exports code
  (ql:quickload :parameters)

  (defpackage parameter-user
    (:use #:cl #:parameters))
#+END_SRC

#+RESULTS:
: #<PACKAGE "PARAMETER-USER">

#+BEGIN_SRC lisp :exports both
  (in-package parameter-user)

  (parameter
   :name "Mass"
   :id :mass
   :value 300d0
   :units "g"
   :constructor (lambda (x) (/ x 1000d0)))

#+END_SRC

#+RESULTS:
: #<SINGLE-PARAMETER Mass (MASS) 300.0d0 g>

A complex problem will usually require a set of parameters. These
parameters can be nested into a container structure
~PARAMETER-CONTAINER~:

#+BEGIN_SRC lisp :exports both
  (in-package parameter-user)

  (parameter
   :name "Ideal gas law parameters"
   :id :ideal-gas
   :children
   (list
    (parameter
     :name "Temperature"
     :id :temperature
     :value 30d0
     :units "C"
     :constructor (lambda (x) (+ x 273.15d0)))
    (parameter
     :name "Volume"
     :id :volume
     :value 2d0
     :units "m3")
    (parameter
     :name "Pressure"
     :id :pressure
     :value 1.5d0
     :units "bar"
     :description "Gas pressure in bar"
     :constructor (lambda (x) (* x 1d5)))))
#+END_SRC

#+RESULTS:
: #<PARAMETER-CONTAINER Ideal gas law parameters (IDEAL-GAS)
:                       (#<SINGLE-PARAMETER Temperature (TEMPERATURE) 30.0d0 C>
:                        #<SINGLE-PARAMETER Volume (VOLUME) 2.0d0 m3>
:                        #<SINGLE-PARAMETER Pressure (PRESSURE) 1.5d0 bar>)>


Each parameter is identified by two compulsory arguments ~:NAME~ and
~:ID~. Optional parameter ~:DESCRIPTION~ provides a longer explanation
of the parameter meaning or usage (defaults to an empty
string). Optional ~:CONSTRUCTOR~ provides a way of transforming
parameter value to actual instance. In example above, for example,
pressure parameter is provided in bars, but calculations will,
probably, require it in Pa. ~:CONSTRUCTOR (LAMBDA (X) (* X 1D5))~
entry provides the conversion. Single-value parameters default the
constructor to identity function. Parameter container does it slightly
differently: most of the time you would want to create a class or
structure instance. To simplify the matter, the default constructor
has a form ~(LAMBDA(&REST ARGS) ARGS)~.

Function ~PARAMETER~ descriminates between the type of parameters
based on the set of keywords provided. Some keywords cannot appear as
an argument together (for example, ~:VALUE~ and ~:CHILDREN~) as the
type of the parameter becomes ambigious.

Before looking at all different types of the parameters, consider the
following example with ideal gas law system:

#+BEGIN_SRC lisp :exports code
  (in-package parameter-user)

  (defstruct idealgas
    "Ideal gas representation structure"
    temperature
    pressure
    volume)

  (defvar *p*
    (parameter
     :name "Ideal gas law parameters"
     :id :ideal-gas
     :children
     (list
      (parameter
       :name "Temperature"
       :id :temperature
       :value 30d0
       :units "C"
       :constructor (lambda (x) (+ x 273.15d0)))
      (parameter
       :name "Volume"
       :id :volume
       :value 2d0
       :units "m3")
      (parameter
       :name "Pressure"
       :id :pressure
       :value 1.5d0
       :units "bar"
       :description "Gas pressure in bar"
       :constructor (lambda (x) (* x 1d5))))
     :constructor #'make-idealgas))
#+END_SRC

#+RESULTS:
: *P*

Ideal gas object can be instantiated using ~INSTANTIATE-OBJECT~
generic function: it will instantiate all subparameters (using their
respective constructors) and then instantiate the container:

#+BEGIN_SRC lisp :exports both
  (in-package parameter-user)

  (instantiate-object *p*)
#+END_SRC

#+RESULTS:
: #S(IDEALGAS :TEMPERATURE 303.15d0 :PRESSURE 150000.0d0 :VOLUME 2.0d0)

Notice, how the temperature is in Kelvin and the pressure is in Pa in
the instance object.

